## how do i create a pandas data frame from another object?

In [1]:
import pandas as pd

In [2]:
pd.DataFrame({'id':[100,101,101],'color':['red','blue','red']},columns=['id','color'])

    id color
0  100   red
1  101  blue
2  101   red

In [3]:
df=pd.DataFrame({'id':[100,101,101],'color':['red','blue','red']},columns=['id','color'],index=['a','b','c'])

In [4]:
pd.DataFrame([[100,'red'],[101,'blue'],[102,'red']])

     0     1
0  100   red
1  101  blue
2  102   red

In [5]:
import numpy as np

In [6]:
arr=np.random.rand(4,2)

In [7]:
arr

array([[0.9351766 , 0.58755032],
       [0.31952561, 0.84801104],
       [0.64910468, 0.98911362],
       [0.00128849, 0.57454937]])

In [8]:
pd.DataFrame(arr,columns=['one','two'])

        one       two
0  0.935177  0.587550
1  0.319526  0.848011
2  0.649105  0.989114
3  0.001288  0.574549

In [14]:
pd.DataFrame({'student':np.arange(100,110,1),'test':np.random.randint(60,101,10)})

   student  test
0      100    63
1      101    76
2      102    73
3      103    81
4      104    83
5      105    89
6      106    76
7      107    73
8      108    69
9      109    83

In [15]:
pd.DataFrame({'student':np.arange(100,110,1),'test':np.random.randint(60,101,10)}).set_index('student')

         test
student
100        85
101        95
102        64
103        73
104        80
105        64
106        93
107        85
108        92
109        99

In [16]:
s=pd.Series(['round','square'],index=['c','b'],name='shape')

In [17]:
s

c     round
b    square
Name: shape, dtype: object

In [18]:
pd.concat([df,s], axis=1)

    id color   shape
a  100   red     NaN
b  101  blue  square
c  101   red   round